In [1]:
import pandas as pd

In [2]:
#creating a data frame
data = {
    'StudentName':['ali','aziz','rose','nora'],
    'StudentGrade':['A+','A','B','B+']
}
Students = pd.DataFrame(data)
Students

  StudentName StudentGrade
0         ali           A+
1        aziz            A
2        rose            B
3        nora           B+

In [3]:
#reading from a csv file
Students = pd.read_csv('students.csv')
Students

      Name Major  Level   GPA
0     Reem    CS      5  4.40
1     Nada    IT      9  4.80
2     Sara    IS      3  3.45
3     Majd    IT      4  4.71
4  Alanoud    CS      9  4.88
5     Amal    IT      4  4.99

In [4]:
#Access data using head() and tail()
Students.head()#shows the first five rows

      Name Major  Level   GPA
0     Reem    CS      5  4.40
1     Nada    IT      9  4.80
2     Sara    IS      3  3.45
3     Majd    IT      4  4.71
4  Alanoud    CS      9  4.88

In [6]:
Students.tail()##shows the last five rows

      Name Major  Level   GPA
1     Nada    IT      9  4.80
2     Sara    IS      3  3.45
3     Majd    IT      4  4.71
4  Alanoud    CS      9  4.88
5     Amal    IT      4  4.99

In [7]:
#we can pass a parameter in head() and tail()
Students.head(3)#(number of rows)

   Name Major  Level   GPA
0  Reem    CS      5  4.40
1  Nada    IT      9  4.80
2  Sara    IS      3  3.45

In [8]:
#the groupby() function
Students[['Major','GPA']]

  Major   GPA
0    CS  4.40
1    IT  4.80
2    IS  3.45
3    IT  4.71
4    CS  4.88
5    IT  4.99

In [12]:
#but we want to group them
Students[['Major','GPA']].groupby('Major').mean()#(the Column you want to group it).after any funcation you want to  execute

            GPA
Major
CS     4.640000
IS     3.450000
IT     4.833333

In [13]:
#another example
Students[['Level','GPA']].groupby('Level').mean()#(the Column you want to group it).after any funcation you want to  execute

        GPA
Level
3      3.45
4      4.85
5      4.40
9      4.84

In [14]:
#the describe() function
Students.describe()

          Level       GPA
count  6.000000  6.000000
mean   5.666667  4.538333
std    2.658320  0.569611
min    3.000000  3.450000
25%    4.000000  4.477500
50%    4.500000  4.755000
75%    8.000000  4.860000
max    9.000000  4.990000

In [18]:
#you can specify
Students.describe(include=object)

        Name Major
count      6     6
unique     6     3
top     Reem    IT
freq       1     3